backend/app/controllers/application_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_account   #JWT will try to call?
      @current_account = Account.find(@account.id)