backend/app/controllers/api/v1/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT "accounts".* FROM "accounts" WHERE (departments) LIMIT ?  [["LIMIT", 1]]

  def create
    @account = Account.new(account_params)
    if @account.save
---
INSERT INTO "accounts" ("name", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pam"], ["balance", 10], ["created_at", "2020-09-02 16:26:51.085729"], ["updated_at", "2020-09-02 16:26:51.085729"]]

  def show
    @account = Account.find_by(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE (1) LIMIT ?  [["LIMIT", 1]]