backend/app/controllers/api/v1/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    if @account = Account.find_by(id: params[:id]) || @account.status == "admin"

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @account = Account.find_by(id: params[:id])