backend/app/controllers/api/v1/departments_controller.rb

  def create
    if account_type == "admin"
  	   @department = @account.departments.new(department_params)
  	   if @department.save
---
INSERT INTO "departments" ("name", "service", "charge", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Credit"], ["service", "Radiology"], ["charge", 200], ["account_id", 1], ["created_at", "2020-09-04 01:22:49.435667"], ["updated_at", "2020-09-04 01:22:49.435667"]]

  def update
    if account_type == "admin"
  	   @department = Department.find(id: params[:id])
---
SELECT "departments".* FROM "departments" WHERE (1) LIMIT ?  [["LIMIT", 1]]

  def destroy
    if account_type == "admin"
  	   @department = Department.find_by(params[:id])
  	   @account = Account.find(@department.account_id)
  	   @department.destroy
---
SELECT "departments".* FROM "departments" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT "departments".* FROM "departments" WHERE "departments"."account_id" = ?  [["account_id", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "departments" WHERE "departments"."id" = ?  [["id", 1]]

  def set_account
  	@account = Account.find(params[:account_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]