backend/app/controllers/api/v1/sessions_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."name" = ? LIMIT ?  [["name", "Frieze"], ["LIMIT", 1]]
---
  def create
    @account = Account.find_by(name: params[:user][:name])